# ==============================================================================
# ЭТАП 1: СБОРКА ПРИЛОЖЕНИЯ (Выполнение требований А и С)
# ==============================================================================
# Требование 2.а: Используем легковесный Alpine-образ Axiom JDK только для компиляции кода
FROM eclipse-temurin:21-jdk-alpine AS compile-stage

WORKDIR /build

# Копируем файлы сборщика Maven и исходный код проекта
COPY mvnw .
COPY mvnw.cmd .
COPY .mvn .mvn
COPY pom.xml .
COPY src src

# Собираем готовый исполняемый .jar файл, отключая тесты
RUN ./mvnw clean package -DskipTests

# ==============================================================================
# ЭТАП 2: ФИНАЛЬНЫЙ ЗАЩИЩЕННЫЙ ОБРАЗ
# ==============================================================================
# Требование 2.а: Использование МИНИМАЛЬНОГО базового образа (только среда выполнения JRE от Axiom)
FROM eclipse-temurin:21-jre-alpine

WORKDIR /app

# Требование 2.с: Отсутствие лишних пакетов. В финальный слой переносим ТОЛЬКО один собранный jar-файл.
COPY --from=compile-stage /build/target/myapp-0.0.1-SNAPSHOT.jar app.jar

# Требование 2.b: Запуск от НЕПРИВИЛЕГИРОВАННОГО пользователя.
# Создаем изолированную группу и пользователя с ограниченными правами внутри Linux-контейнера.
RUN addgroup -S securitygroup && adduser -S securityuser -G securitygroup

# Передаем права на папку приложения нашему новому пользователю
RUN chown -R securityuser:securitygroup /app

# Переключаем контейнер на работу от лица созданного пользователя
USER securityuser

# Требование 2.d: Закрытие ненужных портов.
# Декларируем открытие строго одного рабочего веб-порта нашего приложения.
EXPOSE 8085

# Запуск приложения с флагами оптимизации памяти для виртуальной машины Axiom Java
CMD ["java", "-XX:+UseG1GC", "-XX:MaxRAMPercentage=75.0", "-jar", "app.jar"]